---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementBoundarySubface.Valid
source: html/95ee55cc-a654-4747-02fc-32e7ca06b0ad.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface.Valid Property

Indicates if the subface instance is valid and can be used.

## Syntax (C#)
```csharp
public bool Valid { get; }
```